virgileNeu/ESP8266/sw/demo/WIFI_TCP_led-server.c
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <inttypes.h>
#include <unistd.h>
#include <stdbool.h>
#include <assert.h>

#include "io.h"
#include "system.h"
#include "ressources/esp8266.h"
#include "ressources/i2c_pio.h"
#include "ressources/ws2812.h"

int main() {
	esp8266_dev esp8266 = esp8266_inst(ESP8266_0_BASE);
	i2c_pio_dev pio = i2c_pio_inst(I2C_PIO_0_BASE);
	ws2812_dev ws2812 = ws2812_inst(WS2812_0_BASE);
	ws2812_setPower(&ws2812, 0);
	ws2812_setConfig(&ws2812, WS2812_DEFAULT_LOW_PULSE,
		WS2812_DEFAULT_HIGH_PULSE, WS2812_DEFAULT_BREAK_PULSE,
		WS2812_DEFAULT_CLOCK_DIVIDER);
	uint8_t red, green, blue;
	uint8_t intensity = ws2812_readIntensity(&ws2812);
	ws2812_writePixel(&ws2812, 0, 0, 0, 0);
	ws2812_setIntensity(&ws2812, 0);

	i2c_pio_write(&pio, 0);
	i2c_pio_writebit(&pio, BIT_WIFI_PD_CH, 1);
	i2c_pio_writebit(&pio, BIT_WIFI_RESETn, 1);

	WIFI_set_CTRL(&esp8266, WIFI_UART_ON | WIFI_STOP_0);
	WIFI_set_baud_rate(&esp8266, b115200);

	usleep(1000000); //wait for ESP to stop sending boot info
	WIFI_reset_FIFO(&esp8266, WIFI_RESET_FIFO_IN | WIFI_RESET_FIFO_OUT);

	//commands to create the TCP server

	char message[100];

	WIFI_send_command(&esp8266, "ATE0", 4); //turn off echo
	WIFI_get_data_terminator(&esp8266, message); //the echo (ATE0\r\n)
	WIFI_get_data_terminator(&esp8266, message); //the "\r\n" before the answer
	WIFI_get_data_terminator(&esp8266, message); //the answer
	if(strncmp(message, "OK", 2)) {
		printf("UART command not ok\n");
		return -1;
	}
	WIFI_send_command(&esp8266, "AT+CWMODE=3", 11); //allow softAP + station
	WIFI_get_data_terminator(&esp8266, message); //the answer
	if(strncmp(message, "OK", 2)) {
		printf("UART command not ok\n");
		return -1;
	}

	WIFI_send_command(&esp8266, "AT+CIPMUX=0", 11); //single connection
	WIFI_get_data_terminator(&esp8266, message); //the answer
	if(strncmp(message, "OK", 2)) {
		printf("UART command not ok\n");
		return -1;
	}

	char ssid[20], pass[20];
	printf("SSID?");
	scanf("%s", ssid);
	printf("Password?");
	scanf("%s", pass);
	sprintf(message, "AT+CWJAP=\"%s\",\"%s\"", ssid, pass);
	WIFI_send_command(&esp8266, message, strnlen(message, 100)); //connect to router
	WIFI_get_data_terminator(&esp8266, message); //the answer
	if(strncmp(message, "OK", 2)) {
		printf("UART command not ok\n");
		return -1;
	}

	WIFI_send_command(&esp8266, "AT+CIFSR", 8); //print IP addr
	do {
		WIFI_get_data_terminator(&esp8266, message); //the answer
		printf("%s",message);
	} while(strncmp(message, "OK", 2));

	WIFI_send_command(&esp8266, "AT+CIPSERVER=1", 14); //start server on port 333
	WIFI_get_data_terminator(&esp8266, message); //the answer
	if(strncmp(message, "OK", 2)) {
		printf("UART command not ok\n");
		return -1;
	}

	int loop = 1;
	int stop = 1;
	int len = 0;
	int check = 0;
	/*while(loop) {
		WIFI_get_data_terminator(&esp8266, message);
		check = sscanf(message, "+IPD,%d:%s\r\n", &len, message);
		if(check == 2) {
			if(stop) {
				if(!strncmp(message, "OFF\r\n", 5)) {
					loop = 0;
				} else if(!strncmp(message, "START\r\n", 7)) {
					ws2812_writePixel(&ws2812, 0, red, green, blue);
					ws2812_setIntensity(&ws2812, intensity);
					stop = 0;
				}
			} else {
				if(!strncmp(message, "STOP\r\n", 7)) {
					ws2812_writePixel(&ws2812, 0, 0, 0, 0);
					ws2812_setIntensity(&ws2812, 0);
					stop = 1;
				} else {
					int tmp;
					char c;
					sscanf(message, "%c%d", &c, &tmp);
					switch(c) {
					case 'R': red = tmp; break;
					case 'G': green = tmp; break;
					case 'B': blue = tmp; break;
					}
					ws2812_writePixel(&ws2812, 0, red, green, blue);
				}
			}
		}
	}*/
	printf("DONE");
	return 0;
}

